Catalogs/Причины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>Причины</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдачаСертификата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подарки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актуален</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Причины/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если  ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Добавление справочников доступно только в базе УТ!", ЭтотОбъект);
	КонецЕсли;
		
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Сделка");
	МассивРеквизитов.Добавить("Актуальная");
	
	Если ИзмененыРеквизиты(МассивРеквизитов) Тогда
		Отказ = Истина;
		СтрокаСпискаРеквизитов = "";
		Для Каждого Стр Из МассивРеквизитов Цикл
			СтрокаСпискаРеквизитов = СтрокаСпискаРеквизитов + ?(СтрокаСпискаРеквизитов="",""," ,") + """" + Стр + """";
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрет на изменение реквизитов: " + СтрокаСпискаРеквизитов, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Функция ИзмененыРеквизиты(МассивРеквизитов)
	
	СсылкаНаОбъект = ЭтотОбъект.Ссылка;
	РеквизитыИзменены = Ложь;
	
	Для Каждого Стр Из МассивРеквизитов Цикл
		Если ЭтотОбъект[Стр] <> СсылкаНаОбъект[Стр] Тогда
			РеквизитыИзменены = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РеквизитыИзменены;
	
КонецФункции
	
Процедура ПеренестиОбъектыВТЧ() Экспорт
	СтрокиОтбора = ЭтотОбъект.Объекты.НайтиСтроки(Новый Структура("КлючСтроки",0));
	Для Каждого Стр Из СтрокиОтбора Цикл
		ЭтотОбъект.Объекты.Удалить(Стр);
	КонецЦикла;
	
	Для Каждого Стр Из ЭтотОбъект.Подарки Цикл
		Если Стр.КлючСтроки = 0 Тогда
			Стр.КлючСтроки = ПолучитьНовыйКлючСтроки();
			НовПодарок = ЭтотОбъект.Объекты.Добавить();
			ЗаполнитьЗначенияСвойств(НовПодарок, Стр,,"НомерСтроки");
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьНовыйКлючСтроки(ИмяТЧ = "Подарки") Экспорт
	
	МаксКлюч = 0;
	Если МаксКлюч = 0 Тогда
		Если ЭтотОбъект[ИмяТЧ].Количество() > 1 Тогда
			Для Каждого Стр Из ЭтотОбъект[ИмяТЧ] Цикл
				МаксКлюч = Макс(МаксКлюч, Стр.КлючСтроки);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	МаксКлюч = МаксКлюч + 1;


	Возврат МаксКлюч;

КонецФункции
